In [1]:
import pandas as pd

In [2]:
data = "data/wheat.csv"
df = pd.read_csv(data)

# Production データを取り出す

In [3]:
df2 = df[df['Element'] == 'Production']
df2.head()

        Country     Element    Unit       Value
2   Afghanistan  Production  tonnes   3613300.0
5       Albania  Production  tonnes    240294.0
8       Algeria  Production  tonnes   3981219.0
11       Angola  Production  tonnes      2820.0
14    Argentina  Production  tonnes  18518045.0

# ３番

In [4]:
round(df2['Value'].mean())

5967902

# ４番

In [5]:
df2_sorted = df2.sort_values(by='Value', ascending=False).reset_index(drop=True)
df2_sorted.head(10)

                    Country     Element    Unit        Value
0                     China  Production  tonnes  131447224.0
1                     India  Production  tonnes   99700000.0
2        Russian Federation  Production  tonnes   72136149.0
3  United States of America  Production  tonnes   51286540.0
4                    France  Production  tonnes   35798234.0
5                    Canada  Production  tonnes   31769200.0
6                  Pakistan  Production  tonnes   25076149.0
7                   Ukraine  Production  tonnes   24652840.0
8                 Australia  Production  tonnes   20941134.0
9                   Germany  Production  tonnes   20263500.0

# ５番

In [6]:
japan_data = df2_sorted[df2_sorted['Country'] == 'Japan']
print(japan_data.iloc[0]['Value'])
print(japan_data.index[0] + 1)

764900.0
53

# ６番

In [7]:
df2_sorted = df2_sorted.drop(columns=['Element'])
df2_sorted.head()

                    Country    Unit        Value
0                     China  tonnes  131447224.0
1                     India  tonnes   99700000.0
2        Russian Federation  tonnes   72136149.0
3  United States of America  tonnes   51286540.0
4                    France  tonnes   35798234.0

# ７番

In [8]:
df2_sorted.to_csv("wheat_prod_sorted.csv")